program(7)
. <identifier>(1)
. . test(0)
. consts(0)
. types(0)
. dclns(1)
. . var(2)
. . . <identifier>(1)
. . . . i(0)
. . . <identifier>(1)
. . . . integer(0)
. subprogs(0)
. block(2)
. . assign(2)
. . . <identifier>(1)
. . . . i(0)
. . . <integer>(1)
. . . . 1(0)
. . while(2)
. . . not(1)
. . . . =(2)
. . . . . <identifier>(1)
. . . . . . i(0)
. . . . . <integer>(1)
. . . . . . 11(0)
. . . block(2)
. . . . output(1)
. . . . . integer(1)
. . . . . . <identifier>(1)
. . . . . . . i(0)
. . . . assign(2)
. . . . . <identifier>(1)
. . . . . . i(0)
. . . . . +(2)
. . . . . . <identifier>(1)
. . . . . . . i(0)
. . . . . . <integer>(1)
. . . . . . . 1(0)
. <identifier>(1)
. . test(0)
